validation/liqBox/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application rhoSimpleFoam; startFrom startTime; startTime 0; stopAt endTime; endTime 200; deltaT 1;
writeControl timeStep; writeInterval 200; purgeWrite 0; writeFormat ascii; writePrecision 15;
writeCompression off; timeFormat general; timePrecision 6; runTimeModifiable false;
